zoubata/ArduinoCore-samd/boards.txt
zoubworld_Pilo.menu.cpu.samd20j15a=SAMD20J15A
zoubworld_Pilo.menu.cpu.samd20j15a.bootloader.uploaddevice=ATSAMD20J15
zoubworld_Pilo.menu.cpu.samd20j15a.upload.maximum_size=24576
zoubworld_Pilo.menu.cpu.samd20j15a.build.extra_flags=-D__SAMD20J15A__ {build.usb_flags} 
zoubworld_Pilo.menu.cpu.samd20j15a.build.ldscript=flash_32KB.ld
zoubworld_Pilo.menu.cpu.samd20j15a.build.openocdscript=openocd_scripts/SAMD20J15A.cfg
zoubworld_Pilo.menu.cpu.samd20j15a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD20J15A.bin

zoubworld_Pilo.menu.cpu.samd20j14a=SAMD20J14A
zoubworld_Pilo.menu.cpu.samd20j14a.bootloader.uploaddevice=ATSAMD20J14
zoubworld_Pilo.menu.cpu.samd20j14a.upload.maximum_size=12288
zoubworld_Pilo.menu.cpu.samd20j14a.build.extra_flags=-D__SAMD20J14A__ {build.usb_flags} 
zoubworld_Pilo.menu.cpu.samd20j14a.build.ldscript=flash_16KB.ld
zoubworld_Pilo.menu.cpu.samd20j14a.build.openocdscript=openocd_scripts/SAMD20J14A.cfg
zoubworld_Pilo.menu.cpu.samd20j14a.bootloader.file=Pilo/binaries/sam_ba_Pilo_SAMD20J14A.bin

zoubworld_Pilo.menu.bootloader.4kb=4KB_BOOTLOADER
zoubworld_Pilo.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
zoubworld_Pilo.menu.bootloader.4kb.upload.tool=bossac
zoubworld_Pilo.menu.bootloader.4kb.upload.use_1200bps_touch=true
zoubworld_Pilo.menu.bootloader.4kb.upload.wait_for_upload_port=true
zoubworld_Pilo.menu.bootloader.4kb.upload.native_usb=false

zoubworld_Pilo.menu.bootloader.8kb=8KB_BOOTLOADER
zoubworld_Pilo.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
zoubworld_Pilo.menu.bootloader.8kb.upload.tool=bossac
zoubworld_Pilo.menu.bootloader.8kb.upload.use_1200bps_touch=true
zoubworld_Pilo.menu.bootloader.8kb.upload.wait_for_upload_port=true
zoubworld_Pilo.menu.bootloader.8kb.upload.native_usb=true
zoubworld_Pilo.menu.bootloader.16kb=16KB_BOOTLOADER
zoubworld_Pilo.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
zoubworld_Pilo.menu.bootloader.16kb.upload.tool=bossac
zoubworld_Pilo.menu.bootloader.16kb.upload.use_1200bps_touch=true
zoubworld_Pilo.menu.bootloader.16kb.upload.wait_for_upload_port=true
zoubworld_Pilo.menu.bootloader.16kb.upload.native_usb=true
zoubworld_Pilo.menu.bootloader.0kb=NO_BOOTLOADER
zoubworld_Pilo.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
zoubworld_Pilo.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
zoubworld_Pilo.menu.bootloader.0kb.upload.tool=Jlink
zoubworld_Pilo.menu.bootloader.0kb.upload.use_1200bps_touch=false
zoubworld_Pilo.menu.bootloader.0kb.upload.wait_for_upload_port=false
zoubworld_Pilo.menu.bootloader.0kb.upload.native_usb=false

#zoubworld_Pilo.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
#zoubworld_Pilo.menu.serial.one_uart.build.serialcom_uart=ONE_UART
#zoubworld_Pilo.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
#zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
#zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
#zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
#zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
#zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
#zoubworld_Pilo.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
#zoubworld_Pilo.menu.serial.two_uart.build.serialcom_uart=TWO_UART
#zoubworld_Pilo.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
#zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
#zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
#zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
#zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
#zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
#zoubworld_Pilo.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
#zoubworld_Pilo.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
#zoubworld_Pilo.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
#zoubworld_Pilo.menu.serial.four_uart.build.serialcom_spi=NO_SPI
#zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
#zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
#zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
#zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi=FOUR_UART_ONE_WIRE_ONE_SPI (L21 only)
#zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_uart=FOUR_UART
#zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.four_uart_one_wire_one_spi.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi=FIVE_UART_NO_WIRE_ONE_SPI (L21 only)
#zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_uart=FIVE_UART
#zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
#zoubworld_Pilo.menu.serial.five_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
#zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi=FIVE_UART_ONE_WIRE_NO_SPI (L21 only)
#zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_uart=FIVE_UART
#zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Pilo.menu.serial.five_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
#zoubworld_Pilo.menu.serial.six_uart=SIX_UART_NO_WIRE_NO_SPI (L21 only)
#zoubworld_Pilo.menu.serial.six_uart.build.serialcom_uart=SIX_UART
#zoubworld_Pilo.menu.serial.six_uart.build.serialcom_wire=NO_WIRE
#zoubworld_Pilo.menu.serial.six_uart.build.serialcom_spi=NO_SPI

zoubworld_Pilo.build.serialcom_uart=SIX_UART
zoubworld_Pilo.build.serialcom_wire=NO_WIRE
zoubworld_Pilo.build.serialcom_spi=NO_SPI

#zoubworld_Pilo.menu.usb.cdc=CDC_ONLY
#zoubworld_Pilo.menu.usb.cdc.build.usbcom=CDC_ONLY
#zoubworld_Pilo.menu.usb.cdc.build.pid=0x0557
#zoubworld_Pilo.menu.usb.cdc_hid=CDC_HID
#zoubworld_Pilo.menu.usb.cdc_hid.build.usbcom=CDC_HID
#zoubworld_Pilo.menu.usb.cdc_hid.build.pid=0x0856
#zoubworld_Pilo.menu.usb.withcdc=WITH_CDC
#zoubworld_Pilo.menu.usb.withcdc.build.usbcom=WITH_CDC
#zoubworld_Pilo.menu.usb.withcdc.build.pid=0x0B41
#zoubworld_Pilo.menu.usb.hid=HID_ONLY
#zoubworld_Pilo.menu.usb.hid.build.usbcom=HID_ONLY
#zoubworld_Pilo.menu.usb.hid.build.pid=0x0B40
#zoubworld_Pilo.menu.usb.nocdc=WITHOUT_CDC
#zoubworld_Pilo.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
#zoubworld_Pilo.menu.usb.nocdc.build.pid=0x0A0C
#zoubworld_Pilo.menu.usb.none=USB_DISABLED
#zoubworld_Pilo.menu.usb.none.build.usbcom=USB_DISABLED
#zoubworld_Pilo.menu.usb.none.build.pid=0x0856
zoubworld_Pilo.build.usbcom=USB_DISABLED
#zoubworld_Pilo.menu.com.cdc_uart=CDC_UART
#zoubworld_Pilo.menu.com.cdc_uart.build.board=CDC_UART
#zoubworld_Pilo.menu.com.cdc_uart.build.pid=0x0557
#zoubworld_Pilo.menu.com.cdc_hid_uart=CDC_HID_UART
#zoubworld_Pilo.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#zoubworld_Pilo.menu.com.cdc_hid_uart.build.pid=0x0856
#zoubworld_Pilo.menu.com.cdc_hid=CDC_HID
#zoubworld_Pilo.menu.com.cdc_hid.build.board=CDC_HID
#zoubworld_Pilo.menu.com.cdc_hid.build.pid=0x0856
#zoubworld_Pilo.menu.com.cdc=CDC_ONLY
#zoubworld_Pilo.menu.com.cdc.build.board=CDC_ONLY
#zoubworld_Pilo.menu.com.cdc.build.pid=0x0557
#zoubworld_Pilo.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#zoubworld_Pilo.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
#zoubworld_Pilo.menu.com.cdc_midi_hid_uart.build.pid=0x0B34

