zoubata/ArduinoCore-samd/boards.txt
#zoubworld_Pilo.menu.com.uart=UART_ONLY
#zoubworld_Pilo.menu.com.uart.build.board=UART_ONLY
#zoubworld_Pilo.menu.com.uart.build.pid=0x0856
#zoubworld_Pilo.menu.com.none=USB_UART_DISABLED
#zoubworld_Pilo.menu.com.none.build.board=USB_UART_DISABLED
#zoubworld_Pilo.menu.com.none.build.pid=0x0856


zoubworld_Pilo.build.mcu=cortex-m0plus
zoubworld_Pilo.build.f_cpu=48000000L


#zoubworld_Pilo.build.core=arduino
#zoubworld_Pilo.build.variant=Pilo
#zoubworld_Pilo.build.variant_system_lib=
#zoubworld_Pilo.build.vid=0x16D0
#zoubworld_Pilo.bootloader.tool=arduino:openocd
zoubworld_Pilo.bootloader.tool=Jlink

zoubworld_Pilo.upload.tool=bossac
zoubworld_Pilo.upload.protocol=sam-ba
zoubworld_Pilo.upload.use_1200bps_touch=true
zoubworld_Pilo.upload.wait_for_upload_port=true
zoubworld_Pilo.upload.native_usb=true




# ZoubWorld Captor rev A0
zoubworld_Captor.name=zoubworld Captor (rev A0)(SAM-BA bootloader)
zoubworld_Captor.vid.0=0x2a03
zoubworld_Captor.pid.0=0x004d
zoubworld_Captor.vid.1=0x2a03
zoubworld_Captor.pid.1=0x804d
zoubworld_Captor.vid.2=0x2a03
zoubworld_Captor.pid.2=0x004e
zoubworld_Captor.vid.3=0x2a03
zoubworld_Captor.pid.3=0x804e
zoubworld_Captor.vid.0=0x16D0
zoubworld_Captor.pid.0=0x0557
zoubworld_Captor.vid.1=0x16D0
zoubworld_Captor.pid.1=0x0856
zoubworld_Captor.vid.2=0x16D0
zoubworld_Captor.pid.2=0x0B41
zoubworld_Captor.vid.3=0x16D0
zoubworld_Captor.pid.3=0x0B40
zoubworld_Captor.vid.4=0x16D0
zoubworld_Captor.pid.4=0x0A0C
zoubworld_Captor.vid.5=0x16D0
zoubworld_Captor.pid.5=0x0856
zoubworld_Captor.build.mcu=cortex-m0plus
zoubworld_Captor.build.f_cpu=48000000L
zoubworld_Captor.build.usb_product="Captor Rev A0"
zoubworld_Captor.build.usb_manufacturer="Zoubworld"
zoubworld_Captor.build.board=SAMD_ZERO


zoubworld_Captor.build.core=arduino
zoubworld_Captor.build.variant=Captor
zoubworld_Captor.build.variant_system_lib=
zoubworld_Captor.build.vid=0x16D0

zoubworld_Captor.upload.protocol=sam-ba




zoubworld_Captor.menu.debugboard.normal=Captor
zoubworld_Captor.menu.debugboard.normal.build.boardconfig=BOARD_ID_Captor
zoubworld_Captor.menu.debugboard.debug=engi
zoubworld_Captor.menu.debugboard.debug.build.boardconfig=BOARD_ID_engi

#zoubworld_Captor.build.boardconfig=BOARD_ID_Captor
#zoubworld_Captor.menu.clock.internal=INTERNAL_OSCILLATOR
#zoubworld_Captor.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL





zoubworld_Captor.build.clockconfig=CLOCKCONFIG_INTERNAL

zoubworld_Captor.menu.cpu.samc21n18a=SAMC21N18A
zoubworld_Captor.menu.cpu.samc21n18a.bootloader.uploaddevice=ATSAMC21N18
zoubworld_Captor.menu.cpu.samc21n18a.upload.maximum_size=253952
zoubworld_Captor.menu.cpu.samc21n18a.build.extra_flags=-D__SAMC21N18A__  
zoubworld_Captor.menu.cpu.samc21n18a.build.ldscript=flash_256KB.ld
zoubworld_Captor.menu.cpu.samc21n18a.build.openocdscript=openocd_scripts/samc21n18a.cfg
zoubworld_Captor.menu.cpu.samc21n18a.bootloader.file=Pilo/binaries/sam_ba_Captor_samc21n18a.bin

zoubworld_Captor.menu.cpu.samc21n17a=SAMC21N17A
zoubworld_Captor.menu.cpu.samc21n17a.bootloader.uploaddevice=ATSAMC21N17
zoubworld_Captor.menu.cpu.samc21n17a.upload.maximum_size=122880
zoubworld_Captor.menu.cpu.samc21n17a.build.extra_flags=-D__SAMC21N17A__ 
zoubworld_Captor.menu.cpu.samc21n17a.build.ldscript=flash_128KB.ld
zoubworld_Captor.menu.cpu.samc21n17a.build.openocdscript=openocd_scripts/SAMC21N17A.cfg
zoubworld_Captor.menu.cpu.samc21n17a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N17A.bin

zoubworld_Captor.menu.cpu.samc21n16a=SAMC21N16A
zoubworld_Captor.menu.cpu.samc21n16a.bootloader.uploaddevice=ATSAMC21N16
zoubworld_Captor.menu.cpu.samc21n16a.upload.maximum_size=57344
zoubworld_Captor.menu.cpu.samc21n16a.build.extra_flags=-D__SAMC21N16A__ 
zoubworld_Captor.menu.cpu.samc21n16a.build.ldscript=flash_64KB.ld
zoubworld_Captor.menu.cpu.samc21n16a.build.openocdscript=openocd_scripts/SAMC21N16A.cfg
zoubworld_Captor.menu.cpu.samc21n16a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N16A.bin

zoubworld_Captor.menu.cpu.samc21n15a=SAMC21N15A
zoubworld_Captor.menu.cpu.samc21n15a.bootloader.uploaddevice=ATSAMC21N15
zoubworld_Captor.menu.cpu.samc21n15a.upload.maximum_size=24576
zoubworld_Captor.menu.cpu.samc21n15a.build.extra_flags=-D__SAMC21N15A__  -D__8KB_BOOTLOADER__
zoubworld_Captor.menu.cpu.samc21n15a.build.ldscript=flash_32KB.ld
zoubworld_Captor.menu.cpu.samc21n15a.build.openocdscript=openocd_scripts/SAMC21N15A.cfg
zoubworld_Captor.menu.cpu.samc21n15a.bootloader.file=Pilo/binaries/sam_ba_Captor_SAMC21N15A.bin



zoubworld_Captor.menu.bootloader.4kb=4KB_BOOTLOADER
zoubworld_Captor.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
zoubworld_Captor.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
zoubworld_Captor.menu.bootloader.4kb.upload.tool=bossac
zoubworld_Captor.menu.bootloader.4kb.upload.use_1200bps_touch=true
zoubworld_Captor.menu.bootloader.4kb.upload.wait_for_upload_port=true
zoubworld_Captor.menu.bootloader.4kb.upload.native_usb=false

zoubworld_Captor.menu.bootloader.8kb=8KB_BOOTLOADER
zoubworld_Captor.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
zoubworld_Captor.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
zoubworld_Captor.menu.bootloader.8kb.upload.tool=bossac
zoubworld_Captor.menu.bootloader.8kb.upload.use_1200bps_touch=true
zoubworld_Captor.menu.bootloader.8kb.upload.wait_for_upload_port=true
zoubworld_Captor.menu.bootloader.8kb.upload.native_usb=true

zoubworld_Captor.menu.bootloader.16kb=16KB_BOOTLOADER
zoubworld_Captor.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
zoubworld_Captor.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
zoubworld_Captor.menu.bootloader.16kb.upload.tool=bossac
zoubworld_Captor.menu.bootloader.16kb.upload.use_1200bps_touch=true
zoubworld_Captor.menu.bootloader.16kb.upload.wait_for_upload_port=true
zoubworld_Captor.menu.bootloader.16kb.upload.native_usb=true

zoubworld_Captor.menu.bootloader.0kb=NO_BOOTLOADER
zoubworld_Captor.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
zoubworld_Captor.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
zoubworld_Captor.menu.bootloader.0kb.upload.tool=Jlink
zoubworld_Captor.menu.bootloader.0kb.upload.use_1200bps_touch=false
zoubworld_Captor.menu.bootloader.0kb.upload.wait_for_upload_port=false
zoubworld_Captor.menu.bootloader.0kb.upload.native_usb=false

