zoubata/ArduinoCore-samd/boards.txt
#zoubworld_Captor.menu.usb.cdc=CDC_ONLY
#zoubworld_Captor.menu.usb.cdc.build.usbcom=CDC_ONLY
#zoubworld_Captor.menu.usb.cdc.build.pid=0x0557
#zoubworld_Captor.menu.usb.cdc_hid=CDC_HID
#zoubworld_Captor.menu.usb.cdc_hid.build.usbcom=CDC_HID
#zoubworld_Captor.menu.usb.cdc_hid.build.pid=0x0856
#zoubworld_Captor.menu.usb.withcdc=WITH_CDC
#zoubworld_Captor.menu.usb.withcdc.build.usbcom=WITH_CDC
#zoubworld_Captor.menu.usb.withcdc.build.pid=0x0B41
#zoubworld_Captor.menu.usb.hid=HID_ONLY
#zoubworld_Captor.menu.usb.hid.build.usbcom=HID_ONLY
#zoubworld_Captor.menu.usb.hid.build.pid=0x0B40
#zoubworld_Captor.menu.usb.nocdc=WITHOUT_CDC
#zoubworld_Captor.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
#zoubworld_Captor.menu.usb.nocdc.build.pid=0x0A0C
#zoubworld_Captor.menu.usb.none=USB_DISABLED
#zoubworld_Captor.menu.usb.none.build.usbcom=USB_DISABLED
#zoubworld_Captor.menu.usb.none.build.pid=0x0856

#zoubworld_Captor.menu.com.cdc_uart=CDC_UART
#zoubworld_Captor.menu.com.cdc_uart.build.board=CDC_UART
#zoubworld_Captor.menu.com.cdc_uart.build.pid=0x0557
#zoubworld_Captor.menu.com.cdc_hid_uart=CDC_HID_UART
#zoubworld_Captor.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#zoubworld_Captor.menu.com.cdc_hid_uart.build.pid=0x0856
#zoubworld_Captor.menu.com.cdc_hid=CDC_HID
#zoubworld_Captor.menu.com.cdc_hid.build.board=CDC_HID
#zoubworld_Captor.menu.com.cdc_hid.build.pid=0x0856
#zoubworld_Captor.menu.com.cdc=CDC_ONLY
#zoubworld_Captor.menu.com.cdc.build.board=CDC_ONLY
#zoubworld_Captor.menu.com.cdc.build.pid=0x0557
#zoubworld_Captor.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#zoubworld_Captor.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
#zoubworld_Captor.menu.com.cdc_midi_hid_uart.build.pid=0x0B34




#zoubworld_Captor.menu.serial.default_uart_wire_spi=DEFAULT(captor)
#zoubworld_Captor.menu.serial.default_uart_wire_spi.build.serialcom_uart=SIX_UART
#zoubworld_Captor.menu.serial.default_uart_wire_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Captor.menu.serial.default_uart_wire_spi.build.serialcom_spi=TWO_SPI


zoubworld_Captor.build.serialcom_uart=SIX_UART
zoubworld_Captor.build.serialcom_wire=ONE_WIRE
zoubworld_Captor.build.serialcom_spi=TWO_SPI


#zoubworld_Captor.menu.usb.none=USB_DISABLED
#zoubworld_Captor.menu.usb.none.build.usbcom=USB_DISABLED
#zoubworld_Captor.menu.usb.none.build.pid=0x0856

zoubworld_Captor.build.usbcom=USB_DISABLED
  

zoubworld_Captor.build.mcu=cortex-m0plus
zoubworld_Captor.build.f_cpu=48000000L


zoubworld_Captor.bootloader.tool=Jlink

zoubworld_Captor.upload.tool=bossac
zoubworld_Captor.upload.protocol=sam-ba
zoubworld_Captor.upload.use_1200bps_touch=true
zoubworld_Captor.upload.wait_for_upload_port=true
zoubworld_Captor.upload.native_usb=true




























# ZoubWorld Line rev A0
zoubworld_Line.name=zoubworld Line (rev A0)(SAM-BA bootloader)
zoubworld_Line.vid.0=0x2a03
zoubworld_Line.pid.0=0x004d
zoubworld_Line.vid.1=0x2a03
zoubworld_Line.pid.1=0x804d
zoubworld_Line.vid.2=0x2a03
zoubworld_Line.pid.2=0x004e
zoubworld_Line.vid.3=0x2a03
zoubworld_Line.pid.3=0x804e
zoubworld_Line.vid.0=0x16D0
zoubworld_Line.pid.0=0x0557
zoubworld_Line.vid.1=0x16D0
zoubworld_Line.pid.1=0x0856
zoubworld_Line.vid.2=0x16D0
zoubworld_Line.pid.2=0x0B41
zoubworld_Line.vid.3=0x16D0
zoubworld_Line.pid.3=0x0B40
zoubworld_Line.vid.4=0x16D0
zoubworld_Line.pid.4=0x0A0C
zoubworld_Line.vid.5=0x16D0
zoubworld_Line.pid.5=0x0856
zoubworld_Line.build.mcu=cortex-m0plus
zoubworld_Line.build.f_cpu=48000000L
zoubworld_Line.build.usb_product="Line Rev A0"
zoubworld_Line.build.usb_manufacturer="Zoubworld"
zoubworld_Line.build.board=SAMD_ZERO


zoubworld_Line.build.core=arduino
zoubworld_Line.build.variant=Line
zoubworld_Line.build.variant_system_lib=
zoubworld_Line.build.vid=0x16D0

zoubworld_Line.upload.protocol=sam-ba




#zoubworld_Line.menu.debugboard.normal=Line
#zoubworld_Line.menu.debugboard.normal.build.boardconfig=BOARD_ID_Line
#zoubworld_Line.menu.debugboard.debug=engi
#zoubworld_Line.menu.debugboard.debug.build.boardconfig=BOARD_ID_engi
zoubworld_Line.build.boardconfig=BOARD_ID_Line

#zoubworld_Line.menu.clock.internal=INTERNAL_OSCILLATOR
#zoubworld_Line.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
zoubworld_Line.build.clockconfig=CLOCKCONFIG_INTERNAL


zoubworld_Line.menu.cpu.samd21e18a=SAMD21E18A
zoubworld_Line.menu.cpu.samd21e18a.bootloader.uploaddevice=ATSAMD21E18
zoubworld_Line.menu.cpu.samd21e18a.upload.maximum_size=253952
zoubworld_Line.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__  
zoubworld_Line.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
zoubworld_Line.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/samd21e18a.cfg
zoubworld_Line.menu.cpu.samd21e18a.bootloader.file=Pilo/binaries/sam_ba_Line_samd21e18a.bin

zoubworld_Line.menu.cpu.samd21e17a=SAMD21E17A
zoubworld_Line.menu.cpu.samd21e17a.bootloader.uploaddevice=ATSAMD21E17
zoubworld_Line.menu.cpu.samd21e17a.upload.maximum_size=122880
zoubworld_Line.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ 
zoubworld_Line.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
zoubworld_Line.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
zoubworld_Line.menu.cpu.samd21e17a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E17A.bin

zoubworld_Line.menu.cpu.samd21e16a=SAMD21E16A
zoubworld_Line.menu.cpu.samd21e16a.bootloader.uploaddevice=ATSAMD21E16
zoubworld_Line.menu.cpu.samd21e16a.upload.maximum_size=57344
zoubworld_Line.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ 
zoubworld_Line.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
zoubworld_Line.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
zoubworld_Line.menu.cpu.samd21e16a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E16A.bin

zoubworld_Line.menu.cpu.samd21e15a=SAMD21E15A
zoubworld_Line.menu.cpu.samd21e15a.bootloader.uploaddevice=ATSAMD21E15
zoubworld_Line.menu.cpu.samd21e15a.upload.maximum_size=24576
zoubworld_Line.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ 
zoubworld_Line.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
zoubworld_Line.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
zoubworld_Line.menu.cpu.samd21e15a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD21E15A.bin


zoubworld_Line.menu.cpu.samd20e18a=SAMD20E18A
zoubworld_Line.menu.cpu.samd20e18a.bootloader.uploaddevice=ATSAMD20E18
zoubworld_Line.menu.cpu.samd20e18a.upload.maximum_size=253952
zoubworld_Line.menu.cpu.samd20e18a.build.extra_flags=-D__SAMD20E18__  
zoubworld_Line.menu.cpu.samd20e18a.build.ldscript=flash_256KB.ld
zoubworld_Line.menu.cpu.samd20e18a.build.openocdscript=openocd_scripts/samd20e18a.cfg
zoubworld_Line.menu.cpu.samd20e18a.bootloader.file=Pilo/binaries/sam_ba_Line_samd20e18a.bin

zoubworld_Line.menu.cpu.samd20e17a=SAMD20E17A
zoubworld_Line.menu.cpu.samd20e17a.bootloader.uploaddevice=ATSAMD20E17
zoubworld_Line.menu.cpu.samd20e17a.upload.maximum_size=122880
zoubworld_Line.menu.cpu.samd20e17a.build.extra_flags=-D__SAMD20E17__ 
zoubworld_Line.menu.cpu.samd20e17a.build.ldscript=flash_128KB.ld
zoubworld_Line.menu.cpu.samd20e17a.build.openocdscript=openocd_scripts/SAMD20E17A.cfg
zoubworld_Line.menu.cpu.samd20e17a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E17A.bin

zoubworld_Line.menu.cpu.samd20e16a=SAMD20E16A
zoubworld_Line.menu.cpu.samd20e16a.bootloader.uploaddevice=ATSAMD20E16
zoubworld_Line.menu.cpu.samd20e16a.upload.maximum_size=57344
zoubworld_Line.menu.cpu.samd20e16a.build.extra_flags=-D__SAMD20E16__ 
zoubworld_Line.menu.cpu.samd20e16a.build.ldscript=flash_64KB.ld
zoubworld_Line.menu.cpu.samd20e16a.build.openocdscript=openocd_scripts/SAMD20E16A.cfg
zoubworld_Line.menu.cpu.samd20e16a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E16A.bin

