zoubata/ArduinoCore-samd/boards.txt
zoubworld_Line.menu.cpu.samd20e15a=SAMD20E15A
zoubworld_Line.menu.cpu.samd20e15a.bootloader.uploaddevice=ATSAMD20E15
zoubworld_Line.menu.cpu.samd20e15a.upload.maximum_size=24576
zoubworld_Line.menu.cpu.samd20e15a.build.extra_flags=-D__SAMD20E15__ 
zoubworld_Line.menu.cpu.samd20e15a.build.ldscript=flash_32KB.ld
zoubworld_Line.menu.cpu.samd20e15a.build.openocdscript=openocd_scripts/SAMD20E15A.cfg
zoubworld_Line.menu.cpu.samd20e15a.bootloader.file=Pilo/binaries/sam_ba_Line_SAMD20E15A.bin




zoubworld_Line.menu.bootloader.4kb=4KB_BOOTLOADER
zoubworld_Line.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
zoubworld_Line.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
zoubworld_Line.menu.bootloader.4kb.upload.tool=bossac
zoubworld_Line.menu.bootloader.4kb.upload.use_1200bps_touch=true
zoubworld_Line.menu.bootloader.4kb.upload.wait_for_upload_port=true
zoubworld_Line.menu.bootloader.4kb.upload.native_usb=false

zoubworld_Line.menu.bootloader.8kb=8KB_BOOTLOADER
zoubworld_Line.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
zoubworld_Line.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
zoubworld_Line.menu.bootloader.8kb.upload.tool=bossac
zoubworld_Line.menu.bootloader.8kb.upload.use_1200bps_touch=true
zoubworld_Line.menu.bootloader.8kb.upload.wait_for_upload_port=true
zoubworld_Line.menu.bootloader.8kb.upload.native_usb=true

zoubworld_Line.menu.bootloader.16kb=16KB_BOOTLOADER
zoubworld_Line.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
zoubworld_Line.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
zoubworld_Line.menu.bootloader.16kb.upload.tool=bossac
zoubworld_Line.menu.bootloader.16kb.upload.use_1200bps_touch=true
zoubworld_Line.menu.bootloader.16kb.upload.wait_for_upload_port=true
zoubworld_Line.menu.bootloader.16kb.upload.native_usb=true

zoubworld_Line.menu.bootloader.0kb=NO_BOOTLOADER
zoubworld_Line.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
zoubworld_Line.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
zoubworld_Line.menu.bootloader.0kb.upload.tool=Jlink
zoubworld_Line.menu.bootloader.0kb.upload.use_1200bps_touch=false
zoubworld_Line.menu.bootloader.0kb.upload.wait_for_upload_port=false
zoubworld_Line.menu.bootloader.0kb.upload.native_usb=false

zoubworld_Line.menu.usb.cdc=CDC_ONLY
zoubworld_Line.menu.usb.cdc.build.usbcom=CDC_ONLY
zoubworld_Line.menu.usb.cdc.build.pid=0x0557
zoubworld_Line.menu.usb.cdc_hid=CDC_HID
zoubworld_Line.menu.usb.cdc_hid.build.usbcom=CDC_HID
zoubworld_Line.menu.usb.cdc_hid.build.pid=0x0856
zoubworld_Line.menu.usb.withcdc=WITH_CDC
zoubworld_Line.menu.usb.withcdc.build.usbcom=WITH_CDC
zoubworld_Line.menu.usb.withcdc.build.pid=0x0B41
zoubworld_Line.menu.usb.hid=HID_ONLY
zoubworld_Line.menu.usb.hid.build.usbcom=HID_ONLY
zoubworld_Line.menu.usb.hid.build.pid=0x0B40
zoubworld_Line.menu.usb.nocdc=WITHOUT_CDC
zoubworld_Line.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
zoubworld_Line.menu.usb.nocdc.build.pid=0x0A0C
zoubworld_Line.menu.usb.none=USB_DISABLED
zoubworld_Line.menu.usb.none.build.usbcom=USB_DISABLED
zoubworld_Line.menu.usb.none.build.pid=0x0856

zoubworld_Line.menu.com.cdc_uart=CDC_UART
zoubworld_Line.menu.com.cdc_uart.build.board=CDC_UART
zoubworld_Line.menu.com.cdc_uart.build.pid=0x0557
zoubworld_Line.menu.com.cdc_hid_uart=CDC_HID_UART
zoubworld_Line.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
zoubworld_Line.menu.com.cdc_hid_uart.build.pid=0x0856
zoubworld_Line.menu.com.cdc_hid=CDC_HID
zoubworld_Line.menu.com.cdc_hid.build.board=CDC_HID
zoubworld_Line.menu.com.cdc_hid.build.pid=0x0856
zoubworld_Line.menu.com.cdc=CDC_ONLY
zoubworld_Line.menu.com.cdc.build.board=CDC_ONLY
zoubworld_Line.menu.com.cdc.build.pid=0x0557
zoubworld_Line.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
zoubworld_Line.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
zoubworld_Line.menu.com.cdc_midi_hid_uart.build.pid=0x0B34

zoubworld_Line.menu.com.uart=UART_ONLY
zoubworld_Line.menu.com.uart.build.board=UART_ONLY
zoubworld_Line.menu.com.uart.build.pid=0x0856
zoubworld_Line.menu.com.none=USB_UART_DISABLED
zoubworld_Line.menu.com.none.build.board=USB_UART_DISABLED
zoubworld_Line.menu.com.none.build.pid=0x0856
zoubworld_Line.menu.usb.none=USB_DISABLED
zoubworld_Line.menu.usb.none.build.usbcom=USB_DISABLED
zoubworld_Line.menu.usb.none.build.pid=0x0856


zoubworld_Line.build.mcu=cortex-m0plus
zoubworld_Line.build.f_cpu=48000000L

zoubworld_Line.bootloader.tool=Jlink

zoubworld_Line.upload.tool=bossac
zoubworld_Line.upload.protocol=sam-ba
zoubworld_Line.upload.use_1200bps_touch=true
zoubworld_Line.upload.wait_for_upload_port=true
zoubworld_Line.upload.native_usb=true

#zoubworld_Line.menu.serial.default_uart_wire_spi=DEFAULT(Line)
#zoubworld_Line.menu.serial.default_uart_wire_spi.build.serialcom_uart=SIX_UART
#zoubworld_Line.menu.serial.default_uart_wire_spi.build.serialcom_wire=ONE_WIRE
#zoubworld_Line.menu.serial.default_uart_wire_spi.build.serialcom_spi=TWO_SPI
zoubworld_Line.build.serialcom_uart=SIX_UART
zoubworld_Line.build.serialcom_wire=ONE_WIRE
zoubworld_Line.build.serialcom_spi=TWO_SPI







